rosvall/cc2531_bsp/sfr_addr.h
// SPDX-FileCopyrightText: 2023 Andreas Sig Rosvall
//
// SPDX-License-Identifier: GPL-3.0-or-later

#pragma once
#include <compiler.h>

SFR(P0,             0x80);
SBIT(P0_0,          0x80, 0);
SBIT(P0_1,          0x80, 1);
SBIT(P0_2,          0x80, 2);
SBIT(P0_3,          0x80, 3);
SBIT(P0_4,          0x80, 4);
SBIT(P0_5,          0x80, 5);
SBIT(P0_6,          0x80, 6);
SBIT(P0_7,          0x80, 7);
SFR(SP,             0x81);
SFR(DPL0,           0x82);
SFR(DPH0,           0x83);
SFR(DPL1,           0x84);
SFR(DPH1,           0x85);
SFR(U0CSR,          0x86);
SFR(PCON,           0x87);
SFR(TCON,           0x88);
SBIT(TCON_IT0,      0x88, 0);
SBIT(TCON_RFERRIF,  0x88, 1);
SBIT(TCON_IT1,      0x88, 2);
SBIT(TCON_URX0IF,   0x88, 3);
SBIT(TCON_ADCIF,    0x88, 5);
SBIT(TCON_URX1IF,   0x88, 7);
SFR(P0IFG,          0x89);
SFR(P1IFG,          0x8A);
SFR(P2IFG,          0x8B);
SFR(PICTL,          0x8C);
SFR(P1IEN,          0x8D);
SFR(P0INP,          0x8F);
SFR(P1,             0x90);
SBIT(P1_0,          0x90, 0);
SBIT(P1_1,          0x90, 1);
SBIT(P1_2,          0x90, 2);
SBIT(P1_3,          0x90, 3);
SBIT(P1_4,          0x90, 4);
SBIT(P1_5,          0x90, 5);
SBIT(P1_6,          0x90, 6);
SBIT(P1_7,          0x90, 7);
SFR(RFIRQF1,        0x91);
SFR(DPS,            0x92);
SFR(MPAGE,          0x93);
SFR(_XPAGE,         0x93);
SFR(T2CTRL,         0x94);
SFR(ST0,            0x95);
SFR(ST1,            0x96);
SFR(ST2,            0x97);
SFR(S0CON,          0x98);
SBIT(S0CON_ENCIF_0, 0x98, 0);
SBIT(S0CON_ENCIF_1, 0x98, 1);
SFR(IEN2,           0x9A);
SFR(S1CON,          0x9B);
SFR(T2EVTCFG,       0x9C);
SFR(SLEEPSTA,       0x9D);
SFR(CLKCONSTA,      0x9E);
SFR(FMAP,           0x9F);
SFR(PSBANK,         0x9F);
SFR(P2,             0xA0);
SBIT(P2_0,          0xA0, 0);
SBIT(P2_1,          0xA0, 1);
SBIT(P2_2,          0xA0, 2);
SBIT(P2_3,          0xA0, 3);
SBIT(P2_4,          0xA0, 4);
SFR(T2IRQF,         0xA1);
SFR(T2M0,           0xA2);
SFR(T2M1,           0xA3);
SFR(T2MOVF0,        0xA4);
SFR(T2MOVF1,        0xA5);
SFR(T2MOVF2,        0xA6);
SFR(T2IRQM,         0xA7);
SFR(IEN0,           0xA8);
SBIT(IEN0_RFERRIE,  0xA8, 0);
SBIT(IEN0_ADCIE,    0xA8, 1);
SBIT(IEN0_URX0IE,   0xA8, 2);
SBIT(IEN0_URX1IE,   0xA8, 3);
SBIT(IEN0_ENCIE,    0xA8, 4);
SBIT(IEN0_STIE,     0xA8, 5);
SBIT(IEN0_EA,       0xA8, 7);
SFR(IP0,            0xA9);
SFR(P0IEN,          0xAB);
SFR(P2IEN,          0xAC);
SFR(STLOAD,         0xAD);
SFR(PMUX,           0xAE);
SFR(T1STAT,         0xAF);
SFR(ENCDI,          0xB1);
SFR(ENCDO,          0xB2);
SFR(ENCCS,          0xB3);
SFR(ADCCON1,        0xB4);
SFR(ADCCON2,        0xB5);
SFR(ADCCON3,        0xB6);
SFR(IEN1,           0xB8);
SBIT(IEN1_DMAIE,    0xB8, 0);
SBIT(IEN1_T1IE,     0xB8, 1);
SBIT(IEN1_T2IE,     0xB8, 2);
SBIT(IEN1_T3IE,     0xB8, 3);
SBIT(IEN1_T4IE,     0xB8, 4);
SBIT(IEN1_P0IE,     0xB8, 5);
SFR(IP1,            0xB9);
SFR(ADCL,           0xBA);
SFR(ADCH,           0xBB);
SFR(RNDL,           0xBC);
SFR(RNDH,           0xBD);
SFR(SLEEPCMD,       0xBE);
SFR(RFERRF,         0xBF);
SFR(IRCON,          0xC0);
SBIT(IRCON_DMAIF,   0xC0, 0);
SBIT(IRCON_T1IF,    0xC0, 1);
SBIT(IRCON_T2IF,    0xC0, 2);
SBIT(IRCON_T3IF,    0xC0, 3);
SBIT(IRCON_T4IF,    0xC0, 4);
SBIT(IRCON_P0IF,    0xC0, 5);
SBIT(IRCON_STIF,    0xC0, 7);
SFR(U0DBUF,         0xC1);
SFR(U0BAUD,         0xC2);
SFR(T2MSEL,         0xC3);
SFR(U0UCR,          0xC4);
SFR(U0GCR,          0xC5);
SFR(CLKCONCMD,      0xC6);
SFR(MEMCTR,         0xC7);
SFR(WDCTL,          0xC9);
SFR(T3CNT,          0xCA);
SFR(T3CTL,          0xCB);
SFR(T3CCTL0,        0xCC);
SFR(T3CC0,          0xCD);
SFR(T3CCTL1,        0xCE);
SFR(T3CC1,          0xCF);
SFR(PSW,            0xD0);
SBIT(PSW_P,         0xD0, 0);
SBIT(PSW_F1,        0xD0, 1);
SBIT(PSW_OV,        0xD0, 2);
SBIT(PSW_RS0,       0xD0, 3);
SBIT(PSW_RS1,       0xD0, 4);
SBIT(PSW_F0,        0xD0, 5);
SBIT(PSW_AC,        0xD0, 6);
SBIT(PSW_CY,        0xD0, 7);
SFR(DMAIRQ,         0xD1);
SFR(DMA1CFGL,       0xD2);
SFR(DMA1CFGH,       0xD3);
SFR(DMA0CFGL,       0xD4);
SFR(DMA0CFGH,       0xD5);
SFR(DMAARM,         0xD6);
SFR(DMAREQ,         0xD7);
SFR(TIMIF,          0xD8);
SBIT(TIMIF_T3OVFIF, 0xD8, 0);
SBIT(TIMIF_T3CH0IF, 0xD8, 1);
SBIT(TIMIF_T3CH1IF, 0xD8, 2);
SBIT(TIMIF_T4OVFIF, 0xD8, 3);
SBIT(TIMIF_T4CH0IF, 0xD8, 4);
SBIT(TIMIF_T4CH1IF, 0xD8, 5);
SBIT(TIMIF_T1OVFIM, 0xD8, 6);
SFR(RFD,            0xD9);
SFR(T1CC0L,         0xDA);
SFR(T1CC0H,         0xDB);
SFR(T1CC1L,         0xDC);
SFR(T1CC1H,         0xDD);
SFR(T1CC2L,         0xDE);
SFR(T1CC2H,         0xDF);
SFR(ACC,            0xE0);
SBIT(ACC_0,         0xE0, 0);
SBIT(ACC_1,         0xE0, 1);
SBIT(ACC_2,         0xE0, 2);
SBIT(ACC_3,         0xE0, 3);
SBIT(ACC_4,         0xE0, 4);
SBIT(ACC_5,         0xE0, 5);
SBIT(ACC_6,         0xE0, 6);
SBIT(ACC_7,         0xE0, 7);
SFR(RFST,           0xE1);
SFR(T1CNTL,         0xE2);
SFR(T1CNTH,         0xE3);
SFR(T1CTL,          0xE4);
SFR(T1CCTL0,        0xE5);
SFR(T1CCTL1,        0xE6);
SFR(T1CCTL2,        0xE7);
SFR(IRCON2,         0xE8);
SBIT(IRCON2_P2IF,   0xE8, 0);
SBIT(IRCON2_UTX0IF, 0xE8, 1);
SBIT(IRCON2_UTX1IF, 0xE8, 2);
SBIT(IRCON2_P1IF,   0xE8, 3);
SBIT(IRCON2_WDTIF,  0xE8, 4);
SFR(RFIRQF0,        0xE9);
SFR(T4CNT,          0xEA);
SFR(T4CTL,          0xEB);
SFR(T4CCTL0,        0xEC);
SFR(T4CC0,          0xED);
SFR(T4CCTL1,        0xEE);
SFR(T4CC1,          0xEF);
SFR(B,              0xF0);
SBIT(B_0,           0xF0, 0);
SBIT(B_1,           0xF0, 1);
SBIT(B_2,           0xF0, 2);
SBIT(B_3,           0xF0, 3);
SBIT(B_4,           0xF0, 4);
SBIT(B_5,           0xF0, 5);
SBIT(B_6,           0xF0, 6);
SBIT(B_7,           0xF0, 7);
SFR(PERCFG,         0xF1);
SFR(APCFG,          0xF2);
SFR(P0SEL,          0xF3);
SFR(P1SEL,          0xF4);
SFR(P2SEL,          0xF5);
SFR(P1INP,          0xF6);
SFR(P2INP,          0xF7);
SFR(U1CSR,          0xF8);
SBIT(U1CSR_ACTIVE,  0xF8, 0);
SBIT(U1CSR_TX_BYTE, 0xF8, 1);
SBIT(U1CSR_RX_BYTE, 0xF8, 2);
SBIT(U1CSR_ERR,     0xF8, 3);
SBIT(U1CSR_FE,      0xF8, 4);
SBIT(U1CSR_SLAVE,   0xF8, 5);
SBIT(U1CSR_RE,      0xF8, 6);
SBIT(U1CSR_MODE,    0xF8, 7);
SFR(U1DBUF,         0xF9);
SFR(U1BAUD,         0xFA);
SFR(U1UCR,          0xFB);
SFR(U1GCR,          0xFC);
SFR(P0DIR,          0xFD);
SFR(P1DIR,          0xFE);
SFR(P2DIR,          0xFF);

